# ResourceType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinkedResourceOpeningEventArgs..::..ResourceType Property
LinkedResourceOpeningEventArgs Class See Also
---
The desired linked resource type.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public ExternalResourceType ResourceType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ResourceType As ExternalResourceType
	Get
```

Visual C++
---
```text
public:
property ExternalResourceType^ ResourceType {
	ExternalResourceType^ get ();
}
```

# See Also
LinkedResourceOpeningEventArgs Class
Autodesk.Revit.DB.Events Namespace